meeting/minutes/2026/05-26.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>QT4 CG Meeting 166 Minutes 2026-05-26</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
<link rel="shortcut icon" href="/img/QT4-64.png" />
<link rel="apple-touch-icon" sizes="64x64" href="/img/QT4-64.png" type="image/png" />
<link rel="apple-touch-icon" sizes="76x76" href="/img/QT4-76.png" type="image/png" />
<link rel="apple-touch-icon" sizes="120x120" href="/img/QT4-120.png" type="image/png" />
<link rel="apple-touch-icon" sizes="152x152" href="/img/QT4-152.png" type="image/png" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">QT4 CG Meeting 166 Minutes 2026-05-26</h1>
<p>
<a href="../">Meeting index</a> / <a href="https://qt4cg.org">QT4CG.org</a> / <a href="https://qt4cg.org/dashboard">Dashboard</a> / <a href="https://github.com/qt4cg/qtspecs/issues">GH Issues</a> / <a href="https://github.com/qt4cg/qtspecs/pulls">GH Pull Requests</a>
</p>

<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#new-actions">Summary of new and continuing actions <code>[0/2]</code></a></li>
<li><a href="#minutes">Minutes</a></li>
<li><a href="#administrivia">1. Administrivia</a>
<ul>
<li><a href="#roll-call">1.1. Roll call <code>[9/10]</code></a></li>
<li><a href="#agenda">1.2. Accept the agenda</a></li>
<li><a href="#approve-minutes">1.3. Approve minutes of the previous meeting</a></li>
<li><a href="#next-meeting">1.4. Next meeting</a></li>
<li><a href="#open-actions">1.5. Review of open action items <code>[1/3]</code></a></li>
<li><a href="#open-pull-requests">1.6. Review of open pull requests and issues</a>
<ul>
<li><a href="#blocked">1.6.1. Blocked</a></li>
<li><a href="#merge-without-discussion">1.6.2. Merge without discussion</a></li>
<li><a href="#substantive">1.6.3. Substantive PRs</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#technical-agenda">2. Technical agenda</a>
<ul>
<li><a href="#pr-2628">2.1. PR #2628: 2617 Duration multiplied or divided by number</a></li>
<li><a href="#pr-2646">2.2. PR #2646: 2642 Add compiled-regex attribute to xsl:analyze-string</a></li>
<li><a href="#pr-2649">2.3. PR #2649: 2647 file:descendants: recursion, filtering</a></li>
<li><a href="#pr-2654">2.4. PR #2654: 2652 Clarify lax validation</a></li>
<li><a href="#pr-2656">2.5. PR #2656: 2651 Use termdefs for range variables</a></li>
<li><a href="#pr-2658">2.6. PR #2658: 2655b matching segments empty</a></li>
<li><a href="#pr-2662">2.7. PR #2662: 2659 bin:count-ones, bin:rotate, bin:is-bit-set, bin:sets-bits</a></li>
<li><a href="#pr-2665">2.8. PR #2665: 2663 Change computed node constructors to use standard coercion rules</a></li>
<li><a href="#pr-2666">2.9. PR #2666: 2661 Add content-key option for fn:element-to-map</a></li>
<li><a href="#pr-2667">2.10. PR #2667: 2458 replacement for get() selectors</a></li>
</ul>
</li>
<li><a href="#any-other-business">3. Any other business</a></li>
</ul>
</div>
</div>
<div id="outline-container-new-actions" class="outline-2">
<h2 id="new-actions">Summary of new and continuing actions <code>[0/2]</code></h2>
<div class="outline-text-2" id="text-new-actions">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> QT4CG-143-02: MK to try to recover the ability to extract formal equivalences into tests</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-165-02: NW to draft an agenda for the face-to-face meeting</li>
</ul>
</div>
</div>
<div id="outline-container-minutes" class="outline-2">
<h2 id="minutes">Minutes</h2>
<div class="outline-text-2" id="text-minutes">
<p>
Approved <a href="../2026/06-16.html">at meeting 168</a> on 16 June 2026.
</p>
</div>
</div>
<div id="outline-container-administrivia" class="outline-2">
<h2 id="administrivia"><span class="section-number-2">1.</span> Administrivia</h2>
<div class="outline-text-2" id="text-administrivia">
</div>
<div id="outline-container-roll-call" class="outline-3">
<h3 id="roll-call"><span class="section-number-3">1.1.</span> Roll call <code>[9/10]</code></h3>
<div class="outline-text-3" id="text-roll-call">
<ul class="org-ul">
<li class="on"><code>[X]</code> David J Birnbaum (DB)</li>
<li class="off"><code>[&#xa0;]</code> Reece Dunn (RD)</li>
<li class="on"><code>[X]</code> Christian Grün (CG)</li>
<li class="on"><code>[X]</code> Joel Kalvesmaki (JK)</li>
<li class="on"><code>[X]</code> Michael Kay (MK)</li>
<li class="on"><code>[X]</code> Juri Leino (JLO)</li>
<li class="on"><code>[X]</code> John Lumley (JWL)</li>
<li class="on"><code>[X]</code> Alan Painter (AP)</li>
<li class="on"><code>[X]</code> Wendell Piez (WP)</li>
<li class="on"><code>[X]</code> Norm Tovey-Walsh (NW) <i>Scribe</i>. <i>Chair</i>.</li>
</ul>
</div>
</div>
<div id="outline-container-agenda" class="outline-3">
<h3 id="agenda"><span class="section-number-3">1.2.</span> Accept the agenda</h3>
<div class="outline-text-3" id="text-agenda">
<p>
Proposal: Accept <a href="../../agenda/2026/05-26.html">the agenda</a>.
</p>

<p>
Accepted.
</p>
</div>
</div>
<div id="outline-container-approve-minutes" class="outline-3">
<h3 id="approve-minutes"><span class="section-number-3">1.3.</span> Approve minutes of the previous meeting</h3>
<div class="outline-text-3" id="text-approve-minutes">
<p>
Proposal: Accept <a href="../../minutes/2026/05-19.html">the minutes of the previous meeting</a>.
</p>

<p>
Accepted.
</p>
</div>
</div>
<div id="outline-container-next-meeting" class="outline-3">
<h3 id="next-meeting"><span class="section-number-3">1.4.</span> Next meeting</h3>
<div class="outline-text-3" id="text-next-meeting">
<p>
The next meeting is the face-to-face colocated with XML Prague. I propose that
we skip 9 June and that our first regular meeting after the face-to-face will be
on 16 June.
</p>

<p>
CG gives regrets for 2, 9, and 16 June.
</p>
</div>
</div>
<div id="outline-container-open-actions" class="outline-3">
<h3 id="open-actions"><span class="section-number-3">1.5.</span> Review of open action items <code>[1/3]</code></h3>
<div class="outline-text-3" id="text-open-actions">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> QT4CG-143-02: MK to try to recover the ability to extract formal equivalences into tests</li>
<li class="on"><code>[X]</code> QT4CG-165-01: NW to attempt to draft an AI policy.
<ul class="org-ul">
<li>Completed, <a href="https://lists.w3.org/Archives/Public/public-xslt-40/2026May/0016.html">https://lists.w3.org/Archives/Public/public-xslt-40/2026May/0016.html</a></li>
</ul></li>
<li class="off"><code>[&#xa0;]</code> QT4CG-165-02: NW to draft an agenda for the face-to-face meeting</li>
</ul>
</div>
</div>
<div id="outline-container-open-pull-requests" class="outline-3">
<h3 id="open-pull-requests"><span class="section-number-3">1.6.</span> Review of open pull requests and issues</h3>
<div class="outline-text-3" id="text-open-pull-requests">
<p>
This section summarizes all of the issues and pull requests that need to be
resolved before we can finish. See <a href="#technical-agenda">Technical Agenda</a> below for the focus of this
meeting.
</p>
</div>
<div id="outline-container-blocked" class="outline-4">
<h4 id="blocked"><span class="section-number-4">1.6.1.</span> Blocked</h4>
<div class="outline-text-4" id="text-blocked">
<p>
The following PRs are open but have merge conflicts or comments which
suggest they aren’t ready for action.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2594">#2594</a>: 2389 Adaptive Serialization: more freedom</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2350">#2350</a>: 708 An alternative proposal for generators</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2247">#2247</a>: 716 Deferred Evaluation in XPath - the f:generator record</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2160">#2160</a>: 2073 data model changes for JNodes and Sequences</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2071">#2071</a>: 77c deep update</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2019">#2019</a>: 1776: XSLT template rules for maps and array</li>
</ul>
</div>
</div>
<div id="outline-container-merge-without-discussion" class="outline-4">
<h4 id="merge-without-discussion"><span class="section-number-4">1.6.2.</span> Merge without discussion</h4>
<div class="outline-text-4" id="text-merge-without-discussion">
<p>
The following PRs are editorial, small, or otherwise appeared to be
uncontroversial when the agenda was prepared. The chairs propose that
these can be merged without discussion. If you think discussion is
necessary, please say so.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2650">#2650</a>: 2648 File Module: editorial notes</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2645">#2645</a>: 2565 Absent-vs-Empty fields in dateTime-record</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2643">#2643</a>: 2631 Drop scan-left and scan-right</li>
</ul>

<p>
JK questions whether we should discuss removing scan-left and scan-right.
</p>

<ul class="org-ul">
<li>NW: It’s a simple enough proposal, editorially.</li>
<li>MK: We have no tests for it.</li>
<li>CG: I think it would also need further editorial work.</li>
</ul>

<p>
Proposal: Merge without further discussion.
</p>

<p>
Accepted.
</p>
</div>
</div>
