meeting/minutes/2026/05-26.org
*** Substantive PRs
:PROPERTIES:
:CUSTOM_ID: substantive
:END:

The following substantive PRs were open when this agenda was prepared.

+ PR [[https://qt4cg.org/dashboard/#pr-2667][#2667]]: 2458 replacement for get() selectors
+ PR [[https://qt4cg.org/dashboard/#pr-2666][#2666]]: 2661 Add content-key option for fn:element-to-map
+ PR [[https://qt4cg.org/dashboard/#pr-2665][#2665]]: 2663 Change computed node constructors to use standard coercion rules
+ PR [[https://qt4cg.org/dashboard/#pr-2662][#2662]]: 2659 bin:count-ones, bin:rotate, bin:is-bit-set, bin:sets-bits
+ PR [[https://qt4cg.org/dashboard/#pr-2658][#2658]]: 2655b matching segments empty
+ PR [[https://qt4cg.org/dashboard/#pr-2656][#2656]]: 2651 Use termdefs for range variables
+ PR [[https://qt4cg.org/dashboard/#pr-2654][#2654]]: 2652 Clarify lax validation
+ PR [[https://qt4cg.org/dashboard/#pr-2649][#2649]]: 2647 file:descendants: recursion, filtering
+ PR [[https://qt4cg.org/dashboard/#pr-2646][#2646]]: 2642 Add compiled-regex attribute to xsl:analyze-string
+ PR [[https://qt4cg.org/dashboard/#pr-2638][#2638]]: 2632-6: cross-cutting consistency
+ PR [[https://qt4cg.org/dashboard/#pr-2637][#2637]]: 2632-5: refresh stale 4.0 content
+ PR [[https://qt4cg.org/dashboard/#pr-2636][#2636]]: 2632-4: logic and semantics
+ PR [[https://qt4cg.org/dashboard/#pr-2635][#2635]]: 2632-3: typos and grammar
+ PR [[https://qt4cg.org/dashboard/#pr-2634][#2634]]: 2632-2: fix broken examples in expressions.xml
+ PR [[https://qt4cg.org/dashboard/#pr-2633][#2633]]: 2632-1: fix critical bugs and DTD-validity issues
+ PR [[https://qt4cg.org/dashboard/#pr-2628][#2628]]: 2617 Duration multiplied or divided by number
+ PR [[https://qt4cg.org/dashboard/#pr-2589][#2589]]: 2587 Streamability of context value expressions
+ PR [[https://qt4cg.org/dashboard/#pr-2019][#2019]]: 1776: XSLT template rules for maps and array

* Technical agenda
:PROPERTIES:
:CUSTOM_ID: technical-agenda
:END:

MK proposes to do the items in reverse order of what was proposed in the agenda.

** PR #2628: 2617 Duration multiplied or divided by number
:PROPERTIES:
:CUSTOM_ID: pr-2628
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2628][#2628]]

+ MK: There’s an unnecessary restriction on what  you can multiply by.
  + … The PR replaces the four opertions about multiplying by a number with two operations.
+ MK: The other influence was to get rid of converting the number two a double.
  + … The number of seconds in a duration is a decimal, so you could get strange
    rounding behavior.
+ MK: It effects the mapping tale for arithemetic in the XPath spec, but only trivially.
+ MK: The error conditions were weird, which is another reason why I looked at this

Proposal: accept this PR.

Accepted.

** PR #2646: 2642 Add compiled-regex attribute to xsl:analyze-string
:PROPERTIES:
:CUSTOM_ID: pr-2646
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2646][#2646]]




+ MK: This is by request when we looked at the new regex function.
  + … This fills that gap. And explains its semantics in terms of existing semantics.

Proposal: accept this PR.

Accepted.

** PR #2649: 2647 file:descendants: recursion, filtering
:PROPERTIES:
:CUSTOM_ID: pr-2649
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2649][#2649]]


+ CG: This function can get very slow or memory intensive. If you have a lot of
  subdirectories to parse, the challenge is that the filesystem is nondeterministic.
  + … You can either ~recurse~ or ~filter~.
  + … Filter can be used to limit the number of values returned.
+ CG: The most important option is ~recurse~ which lets you skip some
  directories when doing recurse.
+ JLO: I do think this is a valuable addition; it would be nice if a predicate could automatically do the right thing.
  + … Is this something we want to add to other functions as well?
  + … Especially, since these are callbacks, this is a harder sell than just “yes/no” for the options.
+ CG: I haven’t added a filter to ~file:children~ because it’s a much simpler function.
  + … With respect to other functions, do you have some other functions in mind?
+ JLO: Well, ~fn:collection()~ seems like a similar sort of function.
  + … What about globbing parameters for filter and recurse instead of callbacks?
+ CG: We could use a choice item type and also allow strings.
  + … We have the glob pattern for ~file:list~.
+ NW: You couldn’t exclude things with the glob patterns.
+ JLO: You could use ~!~ in front.
+ MK: The way the position argument is described, “counts the number of times
  the callback has been called”. I wonder how that interacts with multithreading
  and what about order?
+ CG: We won’t have any guarantee about what the first ten items are.
  + … We could remove the position argument. It’s not as valuable here.
+ MK: I think that would be better.
+ JLO: An even broader question: what is the justification to have ~file:descendants~ and ~file:list~?
+ CG: Yes, but ~file:list~ existed before I started working on this. We noticed
  that ~file:children~ would be useful and ~file:descendants~ was added after
  that.
  + … They’re all useful, but you can do everything you need with just some of the functions.
+ JLO: I would always use ~file:list~.
+ CG: That’s interesting, we never do.

CG will review and submit an updated PR.


** PR #2654: 2652 Clarify lax validation
:PROPERTIES:
:CUSTOM_ID: pr-2654
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2654][#2654]]

+ MK: This is purely editorial. There are inconsistent error codes when you
  request lax validation with a processor that doesn’t support validation.
  Should you ignore it, or is it an error?
+ MK: The basic text on validation is now in the Functions and Operators specification.

MK reviews the text.

+ MK: For compatibility reasons, XSLT still behaves differently.
  + … There are clarifications that requesting lax validation on ~fn:doc~ raises a dynamic error.
+ MK: There’s a note explaining why an empty schema can be useful.

Switching to the XSLT specification.

+ MK: In XSLT, we add a note about validation against an empty schema.
  + … We note that backwards compatibility is retained but other constructs raise an error.

Switching to XQuery

+ MK: The note about an empty schema is added.

Proposal: accept this PR.

Accepted.

