meeting/minutes/2026/05-26.html
<div id="outline-container-substantive" class="outline-4">
<h4 id="substantive"><span class="section-number-4">1.6.3.</span> Substantive PRs</h4>
<div class="outline-text-4" id="text-substantive">
<p>
The following substantive PRs were open when this agenda was prepared.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2667">#2667</a>: 2458 replacement for get() selectors</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2666">#2666</a>: 2661 Add content-key option for fn:element-to-map</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2665">#2665</a>: 2663 Change computed node constructors to use standard coercion rules</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2662">#2662</a>: 2659 bin:count-ones, bin:rotate, bin:is-bit-set, bin:sets-bits</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2658">#2658</a>: 2655b matching segments empty</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2656">#2656</a>: 2651 Use termdefs for range variables</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2654">#2654</a>: 2652 Clarify lax validation</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2649">#2649</a>: 2647 <a href="descendants">descendants</a>: recursion, filtering</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2646">#2646</a>: 2642 Add compiled-regex attribute to xsl:analyze-string</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2638">#2638</a>: 2632-6: cross-cutting consistency</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2637">#2637</a>: 2632-5: refresh stale 4.0 content</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2636">#2636</a>: 2632-4: logic and semantics</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2635">#2635</a>: 2632-3: typos and grammar</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2634">#2634</a>: 2632-2: fix broken examples in expressions.xml</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2633">#2633</a>: 2632-1: fix critical bugs and DTD-validity issues</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2628">#2628</a>: 2617 Duration multiplied or divided by number</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2589">#2589</a>: 2587 Streamability of context value expressions</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2019">#2019</a>: 1776: XSLT template rules for maps and array</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-technical-agenda" class="outline-2">
<h2 id="technical-agenda"><span class="section-number-2">2.</span> Technical agenda</h2>
<div class="outline-text-2" id="text-technical-agenda">
<p>
MK proposes to do the items in reverse order of what was proposed in the agenda.
</p>
</div>
<div id="outline-container-pr-2628" class="outline-3">
<h3 id="pr-2628"><span class="section-number-3">2.1.</span> PR #2628: 2617 Duration multiplied or divided by number</h3>
<div class="outline-text-3" id="text-pr-2628">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2628">#2628</a>
</p>

<ul class="org-ul">
<li>MK: There’s an unnecessary restriction on what  you can multiply by.
<ul class="org-ul">
<li>… The PR replaces the four opertions about multiplying by a number with two operations.</li>
</ul></li>
<li>MK: The other influence was to get rid of converting the number two a double.
<ul class="org-ul">
<li>… The number of seconds in a duration is a decimal, so you could get strange
rounding behavior.</li>
</ul></li>
<li>MK: It effects the mapping tale for arithemetic in the XPath spec, but only trivially.</li>
<li>MK: The error conditions were weird, which is another reason why I looked at this</li>
</ul>

<p>
Proposal: accept this PR.
</p>

<p>
Accepted.
</p>
</div>
</div>
<div id="outline-container-pr-2646" class="outline-3">
<h3 id="pr-2646"><span class="section-number-3">2.2.</span> PR #2646: 2642 Add compiled-regex attribute to xsl:analyze-string</h3>
<div class="outline-text-3" id="text-pr-2646">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2646">#2646</a>
</p>




<ul class="org-ul">
<li>MK: This is by request when we looked at the new regex function.
<ul class="org-ul">
<li>… This fills that gap. And explains its semantics in terms of existing semantics.</li>
</ul></li>
</ul>

<p>
Proposal: accept this PR.
</p>

<p>
Accepted.
</p>
</div>
</div>
<div id="outline-container-pr-2649" class="outline-3">
<h3 id="pr-2649"><span class="section-number-3">2.3.</span> PR #2649: 2647 <a href="descendants">descendants</a>: recursion, filtering</h3>
<div class="outline-text-3" id="text-pr-2649">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2649">#2649</a>
</p>


<ul class="org-ul">
<li>CG: This function can get very slow or memory intensive. If you have a lot of
subdirectories to parse, the challenge is that the filesystem is nondeterministic.
<ul class="org-ul">
<li>… You can either <code>recurse</code> or <code>filter</code>.</li>
<li>… Filter can be used to limit the number of values returned.</li>
</ul></li>
<li>CG: The most important option is <code>recurse</code> which lets you skip some
directories when doing recurse.</li>
<li>JLO: I do think this is a valuable addition; it would be nice if a predicate could automatically do the right thing.
<ul class="org-ul">
<li>… Is this something we want to add to other functions as well?</li>
<li>… Especially, since these are callbacks, this is a harder sell than just “yes/no” for the options.</li>
</ul></li>
<li>CG: I haven’t added a filter to <code>file:children</code> because it’s a much simpler function.
<ul class="org-ul">
<li>… With respect to other functions, do you have some other functions in mind?</li>
</ul></li>
<li>JLO: Well, <code>fn:collection()</code> seems like a similar sort of function.
<ul class="org-ul">
<li>… What about globbing parameters for filter and recurse instead of callbacks?</li>
</ul></li>
<li>CG: We could use a choice item type and also allow strings.
<ul class="org-ul">
<li>… We have the glob pattern for <code>file:list</code>.</li>
</ul></li>
<li>NW: You couldn’t exclude things with the glob patterns.</li>
<li>JLO: You could use <code>!</code> in front.</li>
<li>MK: The way the position argument is described, “counts the number of times
the callback has been called”. I wonder how that interacts with multithreading
and what about order?</li>
<li>CG: We won’t have any guarantee about what the first ten items are.
<ul class="org-ul">
<li>… We could remove the position argument. It’s not as valuable here.</li>
</ul></li>
<li>MK: I think that would be better.</li>
<li>JLO: An even broader question: what is the justification to have <code>file:descendants</code> and <code>file:list</code>?</li>
<li>CG: Yes, but <code>file:list</code> existed before I started working on this. We noticed
that <code>file:children</code> would be useful and <code>file:descendants</code> was added after
that.
<ul class="org-ul">
<li>… They’re all useful, but you can do everything you need with just some of the functions.</li>
</ul></li>
<li>JLO: I would always use <code>file:list</code>.</li>
<li>CG: That’s interesting, we never do.</li>
</ul>

<p>
CG will review and submit an updated PR.
</p>
</div>
</div>
<div id="outline-container-pr-2654" class="outline-3">
<h3 id="pr-2654"><span class="section-number-3">2.4.</span> PR #2654: 2652 Clarify lax validation</h3>
<div class="outline-text-3" id="text-pr-2654">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2654">#2654</a>
</p>

<ul class="org-ul">
<li>MK: This is purely editorial. There are inconsistent error codes when you
request lax validation with a processor that doesn’t support validation.
Should you ignore it, or is it an error?</li>
<li>MK: The basic text on validation is now in the Functions and Operators specification.</li>
</ul>

<p>
MK reviews the text.
</p>

<ul class="org-ul">
<li>MK: For compatibility reasons, XSLT still behaves differently.
<ul class="org-ul">
<li>… There are clarifications that requesting lax validation on <code>fn:doc</code> raises a dynamic error.</li>
</ul></li>
<li>MK: There’s a note explaining why an empty schema can be useful.</li>
</ul>

<p>
Switching to the XSLT specification.
</p>

<ul class="org-ul">
<li>MK: In XSLT, we add a note about validation against an empty schema.
<ul class="org-ul">
<li>… We note that backwards compatibility is retained but other constructs raise an error.</li>
</ul></li>
</ul>

<p>
Switching to XQuery
</p>

<ul class="org-ul">
<li>MK: The note about an empty schema is added.</li>
</ul>

<p>
Proposal: accept this PR.
</p>

<p>
Accepted.
</p>
</div>
</div>
