meeting/minutes/2026/05-26.org
** PR #2656: 2651 Use termdefs for range variables
:PROPERTIES:
:CUSTOM_ID: pr-2656
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2656][#2656]]

+ MK: When we did the expanding of ~for~ and ~let~ expressions in XPath, there’s
  now duplicated text in the spec between the XPath and XQuery specs.
  + … There sufficiently different, but they do have duplicated text.
  + … But the IDs of everything have to be unique in the combined and separated specifications.
  + … That’s a problem, which I initially resolved by not making them defined terms.
+ MK: There’s a question of why we introduced the term ~range variable~. But regardless, it’s a term of art now.
+ MK: It comes up a bit diffferently in XPath and XQuery.

In XPath:

+ MK: A bunch of new defined terms are added, but nothing changes about the semantics.

In XQuery:

+ MK: It’s similar; there are new definitions and tries to use them consistently.
  + … Also, I moved a pargraph that was in completely the wrong place.

Proposal: accept this PR.

Accepted.

** PR #2658: 2655b matching segments empty
:PROPERTIES:
:CUSTOM_ID: pr-2658
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2658][#2658]]

+ MK: This was  a request to make the new ~fn:matching-segments~ function behave more consistently with other regex functions.
  + … If the value is the empty sequence, we treat it as the empty string, and don’t return an empty sequence.
+ JWL: In almost the last example, where you have matching segments with an empty string as the value.
  + … So the empty sequence is equivalent to the empty string?
+ MK: Yes.

Proposal: accept this PR.

Accepted.

** PR #2662: 2659 bin:count-ones, bin:rotate, bin:is-bit-set, bin:sets-bits
:PROPERTIES:
:CUSTOM_ID: pr-2662
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2662][#2662]]

+ CG: This is about the binary module. We used it in a project where we wanted to compute the Hamming distance.
  + … That turned out to be surprisingly difficult. These functions improve that.
  + … The name ~count-ones~ is a comprimise.
+ CG: After adding that, I also added ~is-bit-set~, ~set-bits~, and ~rotate~ (as an alternative to ~shift~).
+ CG: In ~set-bits~, it’s a sequence to simplify use when you want to set more than one bit.
  + … Obviously, we didn’t invent this module to do bit operations, but in practice this works fairly well.
+ JLO: I believe that all of this is necessary, how about ~count-set-bits~ since we have ~is-bit-set~ and ~set-bits~?

Some discussion of the difference between ~shift~ and ~rotate~.

+ JWL: The bit shift when it was original done shifted zeros in from the end. I don’t know why we didn’t think about rotate.

+ JWL: I think we should name it ~count-bits-set~ to avoid some ambiguity.

Proposal: rename ~count-ones~ to ~count-bits~set~ then merge.

Accepted.

** PR #2665: 2663 Change computed node constructors to use standard coercion rules
:PROPERTIES:
:CUSTOM_ID: pr-2665
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2665][#2665]]

+ MK: This is another one that came out of Sheila’s work
+ MK: The current logic for computed node constructors where you specify the
  name of the constructor has special rules for the name
  + … This is different from the standard rules, at least with respect to ~xs:anyURI~.
  + … That means the implementation can’t use the same code, so there are different error codes.
+ MK: This PR changes them so they use the standard coercion rules.
  + … The rules get a little simpler for each of the node types.
+ MK: The only observable effect of this change is that the error codes are
  different (and ~xs:anyURI~ is accepted, which requires changing some tests).

Proposal: accept this PR.

Accepted.

** PR #2666: 2661 Add content-key option for fn:element-to-map
:PROPERTIES:
:CUSTOM_ID: pr-2666
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2666][#2666]]

+ MK: The specification for ~element-to-map~ allows you to customize the ~@~
  symbol for attributes, but not the ~#content~ magic string.
  + … This just adds another option that allows you to control that.

Some discussion of how setting ~attribute-marker~ and ~content-key~ to the same string would be problematic.

+ MK: That’s where the rule for inserting additional “#” to make a unique string applies.

Proposal: accept this PR.

Accepted.

** PR #2667: 2458 replacement for get() selectors
:PROPERTIES:
:CUSTOM_ID: pr-2667
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2667][#2667]]

+ MK: This is a fairly significant change. Let’s begin with an introduction.
  + … The use of ~get()~ selectors has never sat very well.
+ MK: Just overloading “/” does quite different things.
+ MK: The NodeTest in an AxisStep now allows a computed name or key ~ancestor::{$name}~.
  + … And it changes what happens if you have atomic values on the right if you have JNodes on the left.
+ MK: So how do we evaluate the “/” operator?
  + … We split the cases for XNodes and JNodes
  + … Any maps or arrays on the left are converted to JNodes
  + … The left hand side must be *all* XNodes or *all* JNodes.
  + … The semantics for XNodes are the same as they have been.
  + … But for a sequence of JNodes, there are new rules.

MK reviews the new rules.

+ MK: The JNodes are always returned in document order.
+ MK: The grammar change is that a node test can include an enclosed ~Expr~. The
  ~Selector~ can’t. … You can only use the replacement if you have an explicit
  axis (because a free-standing expression beginning with braces already has a
  specified meaning).
+ MK: On the JNode side, you can now do things like ~$map/$key~.
  + … There are lots of examples of selecting from maps and arrays.

MK reviews the equivalence to JSONPath.

+ JWL: If we’re running in XSLT, are we going to get conflicts with value templates?
+ MK: No, it’s just another thing with curly braces.
+ JWL: But this is the first time they occur in a slector.
+ MK: Yes, we probably need to look at the impact on patterns.
+ CG: With regard to the curly braces, I wonder if we could use parenthesis instead.
  + … That would make things more similar to the lookup expression.
  + … The semantics are fairly different if you remove the axis.
+ MK: I like the curly brackets. It is indicative of substituting a value.
  + … There’s some overlap with the union syntax that needs investigating.

* Any other business
:PROPERTIES:
:CUSTOM_ID: any-other-business
:END:

