meeting/minutes/2026/05-26.html
<div id="outline-container-pr-2656" class="outline-3">
<h3 id="pr-2656"><span class="section-number-3">2.5.</span> PR #2656: 2651 Use termdefs for range variables</h3>
<div class="outline-text-3" id="text-pr-2656">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2656">#2656</a>
</p>

<ul class="org-ul">
<li>MK: When we did the expanding of <code>for</code> and <code>let</code> expressions in XPath, there’s
now duplicated text in the spec between the XPath and XQuery specs.
<ul class="org-ul">
<li>… There sufficiently different, but they do have duplicated text.</li>
<li>… But the IDs of everything have to be unique in the combined and separated specifications.</li>
<li>… That’s a problem, which I initially resolved by not making them defined terms.</li>
</ul></li>
<li>MK: There’s a question of why we introduced the term <code>range variable</code>. But regardless, it’s a term of art now.</li>
<li>MK: It comes up a bit diffferently in XPath and XQuery.</li>
</ul>

<p>
In XPath:
</p>

<ul class="org-ul">
<li>MK: A bunch of new defined terms are added, but nothing changes about the semantics.</li>
</ul>

<p>
In XQuery:
</p>

<ul class="org-ul">
<li>MK: It’s similar; there are new definitions and tries to use them consistently.
<ul class="org-ul">
<li>… Also, I moved a pargraph that was in completely the wrong place.</li>
</ul></li>
</ul>

<p>
Proposal: accept this PR.
</p>

<p>
Accepted.
</p>
</div>
</div>
<div id="outline-container-pr-2658" class="outline-3">
<h3 id="pr-2658"><span class="section-number-3">2.6.</span> PR #2658: 2655b matching segments empty</h3>
<div class="outline-text-3" id="text-pr-2658">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2658">#2658</a>
</p>

<ul class="org-ul">
<li>MK: This was  a request to make the new <code>fn:matching-segments</code> function behave more consistently with other regex functions.
<ul class="org-ul">
<li>… If the value is the empty sequence, we treat it as the empty string, and don’t return an empty sequence.</li>
</ul></li>
<li>JWL: In almost the last example, where you have matching segments with an empty string as the value.
<ul class="org-ul">
<li>… So the empty sequence is equivalent to the empty string?</li>
</ul></li>
<li>MK: Yes.</li>
</ul>

<p>
Proposal: accept this PR.
</p>

<p>
Accepted.
</p>
</div>
</div>
<div id="outline-container-pr-2662" class="outline-3">
<h3 id="pr-2662"><span class="section-number-3">2.7.</span> PR #2662: 2659 bin:count-ones, bin:rotate, bin:is-bit-set, bin:sets-bits</h3>
<div class="outline-text-3" id="text-pr-2662">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2662">#2662</a>
</p>

<ul class="org-ul">
<li>CG: This is about the binary module. We used it in a project where we wanted to compute the Hamming distance.
<ul class="org-ul">
<li>… That turned out to be surprisingly difficult. These functions improve that.</li>
<li>… The name <code>count-ones</code> is a comprimise.</li>
</ul></li>
<li>CG: After adding that, I also added <code>is-bit-set</code>, <code>set-bits</code>, and <code>rotate</code> (as an alternative to <code>shift</code>).</li>
<li>CG: In <code>set-bits</code>, it’s a sequence to simplify use when you want to set more than one bit.
<ul class="org-ul">
<li>… Obviously, we didn’t invent this module to do bit operations, but in practice this works fairly well.</li>
</ul></li>
<li>JLO: I believe that all of this is necessary, how about <code>count-set-bits</code> since we have <code>is-bit-set</code> and <code>set-bits</code>?</li>
</ul>

<p>
Some discussion of the difference between <code>shift</code> and <code>rotate</code>.
</p>

<ul class="org-ul">
<li>JWL: The bit shift when it was original done shifted zeros in from the end. I don’t know why we didn’t think about rotate.</li>

<li>JWL: I think we should name it <code>count-bits-set</code> to avoid some ambiguity.</li>
</ul>

<p>
Proposal: rename <code>count-ones</code> to <code>count-bits~set</code> then merge.
</p>

<p>
Accepted.
</p>
</div>
</div>
<div id="outline-container-pr-2665" class="outline-3">
<h3 id="pr-2665"><span class="section-number-3">2.8.</span> PR #2665: 2663 Change computed node constructors to use standard coercion rules</h3>
<div class="outline-text-3" id="text-pr-2665">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2665">#2665</a>
</p>

<ul class="org-ul">
<li>MK: This is another one that came out of Sheila’s work</li>
<li>MK: The current logic for computed node constructors where you specify the
name of the constructor has special rules for the name
<ul class="org-ul">
<li>… This is different from the standard rules, at least with respect to <code>xs:anyURI</code>.</li>
<li>… That means the implementation can’t use the same code, so there are different error codes.</li>
</ul></li>
<li>MK: This PR changes them so they use the standard coercion rules.
<ul class="org-ul">
<li>… The rules get a little simpler for each of the node types.</li>
</ul></li>
<li>MK: The only observable effect of this change is that the error codes are
different (and <code>xs:anyURI</code> is accepted, which requires changing some tests).</li>
</ul>

<p>
Proposal: accept this PR.
</p>

<p>
Accepted.
</p>
</div>
</div>
<div id="outline-container-pr-2666" class="outline-3">
<h3 id="pr-2666"><span class="section-number-3">2.9.</span> PR #2666: 2661 Add content-key option for fn:element-to-map</h3>
<div class="outline-text-3" id="text-pr-2666">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2666">#2666</a>
</p>

<ul class="org-ul">
<li>MK: The specification for <code>element-to-map</code> allows you to customize the <code>@</code>
symbol for attributes, but not the <code>#content</code> magic string.
<ul class="org-ul">
<li>… This just adds another option that allows you to control that.</li>
</ul></li>
</ul>

<p>
Some discussion of how setting <code>attribute-marker</code> and <code>content-key</code> to the same string would be problematic.
</p>

<ul class="org-ul">
<li>MK: That’s where the rule for inserting additional “#” to make a unique string applies.</li>
</ul>

<p>
Proposal: accept this PR.
</p>

<p>
Accepted.
</p>
</div>
</div>
<div id="outline-container-pr-2667" class="outline-3">
<h3 id="pr-2667"><span class="section-number-3">2.10.</span> PR #2667: 2458 replacement for get() selectors</h3>
<div class="outline-text-3" id="text-pr-2667">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2667">#2667</a>
</p>

<ul class="org-ul">
<li>MK: This is a fairly significant change. Let’s begin with an introduction.
<ul class="org-ul">
<li>… The use of <code>get()</code> selectors has never sat very well.</li>
</ul></li>
<li>MK: Just overloading “/” does quite different things.</li>
<li>MK: The NodeTest in an AxisStep now allows a computed name or key <code>ancestor::{$name}</code>.
<ul class="org-ul">
<li>… And it changes what happens if you have atomic values on the right if you have JNodes on the left.</li>
</ul></li>
<li>MK: So how do we evaluate the “/” operator?
<ul class="org-ul">
<li>… We split the cases for XNodes and JNodes</li>
<li>… Any maps or arrays on the left are converted to JNodes</li>
<li>… The left hand side must be <b>all</b> XNodes or <b>all</b> JNodes.</li>
<li>… The semantics for XNodes are the same as they have been.</li>
<li>… But for a sequence of JNodes, there are new rules.</li>
</ul></li>
</ul>

<p>
MK reviews the new rules.
</p>

<ul class="org-ul">
<li>MK: The JNodes are always returned in document order.</li>
<li>MK: The grammar change is that a node test can include an enclosed <code>Expr</code>. The
<code>Selector</code> can’t. … You can only use the replacement if you have an explicit
axis (because a free-standing expression beginning with braces already has a
specified meaning).</li>
<li>MK: On the JNode side, you can now do things like <code>$map/$key</code>.
<ul class="org-ul">
<li>… There are lots of examples of selecting from maps and arrays.</li>
</ul></li>
</ul>

<p>
MK reviews the equivalence to JSONPath.
</p>

<ul class="org-ul">
<li>JWL: If we’re running in XSLT, are we going to get conflicts with value templates?</li>
<li>MK: No, it’s just another thing with curly braces.</li>
<li>JWL: But this is the first time they occur in a slector.</li>
<li>MK: Yes, we probably need to look at the impact on patterns.</li>
<li>CG: With regard to the curly braces, I wonder if we could use parenthesis instead.
<ul class="org-ul">
<li>… That would make things more similar to the lookup expression.</li>
<li>… The semantics are fairly different if you remove the axis.</li>
</ul></li>
<li>MK: I like the curly brackets. It is indicative of substituting a value.
<ul class="org-ul">
<li>… There’s some overlap with the union syntax that needs investigating.</li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-any-other-business" class="outline-2">
<h2 id="any-other-business"><span class="section-number-2">3.</span> Any other business</h2>
<div class="outline-text-2" id="text-any-other-business">
</div>
</div>
</div>
</body>
</html>
